text
"<s>Parse In what city is the Heineken brewery? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q854383> <http://www.wikidata.org/prop/direct/P176>/<http://www.wikidata.org/prop/direct/P159> ?uri . }</s>"
"<s>Parse Is Barack Obama a democrat? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P102 wd:Q29552 . }</s>"
"<s>Parse List the children of Margaret Thatcher. to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }</s>"
"<s>Parse how big is the total area of North Rhine- Westphalia? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }</s>"
"<s>Parse Which city has the most inhabitants? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:279* wd:Q515 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1</s>"
"<s>Parse What is Donald Trump's main business? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } }</s>"
"<s>Parse When will start the final match of the football world cup 2018? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q170645 wdt:P3967 ?finalEvent . ?finalEvent wdt:P580 ?val . }</s>"
"<s>Parse Which films did Stanley Kubrick direct? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q2001>}</s>"
"<s>Parse how much is the population Iraq? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q796 wdt:P1082 ?val . }</s>"
"<s>Parse How many inhabitants does the largest city in Canada have? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1</s>"
"<s>Parse Who is the mayor of the capital of French Polynesia? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q30971 wdt:P36 ?capital . ?capital wdt:P6 ?uri . }</s>"
"<s>Parse Give me all actors starring in movies directed by William Shatner. to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . }</s>"
"<s>Parse How tall is Claudia Schiffer? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q76717 wdt:P2048 ?val . }</s>"
"<s>Parse What is the highest mountain in Italy? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1</s>"
"<s>Parse List all games by GMT. to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }</s>"
"<s>Parse What is the official language of Suriname? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q730> <http://www.wikidata.org/prop/direct/P37> ?uri . }</s>"
"<s>Parse In which city did Nikos Kazantzakis die? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q214622> <http://www.wikidata.org/prop/direct/P20> ?uri }</s>"
"<s>Parse What is in a chocolate chip cookie? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q14169302> <http://www.wikidata.org/prop/direct/P527> ?uri}</s>"
"<s>Parse In which country is the Limerick Lake? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q6386177> <http://www.wikidata.org/prop/direct/P17> ?uri . }</s>"
"<s>Parse Give me all members of Prodigy. to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }</s>"
"<s>Parse In which time zone is Rome? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q220> <http://www.wikidata.org/prop/direct/P421> ?uri }</s>"
"<s>Parse Who are the writers of the Wall album of Pink Floyd? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . }</s>"
"<s>Parse Who is the mayor of Rotterdam? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q34370 wdt:P6 ?uri . }</s>"
"<s>Parse What is the largest city in Australia? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q515 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1</s>"
"<s>Parse Who was married to president Chirac? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2105 wdt:P26 ?uri . }</s>"
"<s>Parse What form of government is found in South Africa? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q258 wdt:P122 ?uri . }</s>"
"<s>Parse How high is the Yokohama Marine Tower? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . }</s>"
"<s>Parse Which holidays are celebrated around the world? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q1445650 . }</s>"
"<s>Parse Who is the tallest basketball player? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1</s>"
"<s>Parse ¿Quién es el jugador de baloncesto más alto? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1</s>"
"<s>Parse Wer ist der größte Basketballspieler? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1</s>"
"<s>Parse How many languages are spoken in Turkmenistan? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q874 wdt:P2936 ?uri . }</s>"
"<s>Parse Did Che Guevara have children? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5809 wdt:P40 ?uri . }</s>"
"<s>Parse Did Kaurismäki ever win the Grand Prix at Cannes? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q276186> <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q844804> . }</s>"
"<s>Parse To which party does the mayor of Paris belong? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6>/<http://www.wikidata.org/prop/direct/P102> ?uri }</s>"
"<s>Parse Who is the Formula 1 race driver with the most races? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P1350 ?num . } ORDER BY DESC(?num) LIMIT 1</s>"
"<s>Parse What country is Sitecore from? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2663195> <http://www.wikidata.org/prop/direct/P17> ?uri }</s>"
"<s>Parse Give me the birth place of Frank Sinatra. to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }</s>"
"<s>Parse Is Christian Bale starring in Velvet Goldmine? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1481540 wdt:P161 wd:Q45772 . }</s>"
"<s>Parse Who is the son of Sonny and Cher? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P22> <http://www.wikidata.org/entity/Q179150> . ?uri <http://www.wikidata.org/prop/direct/P25> <http://www.wikidata.org/entity/Q12003> . }</s>"
"<s>Parse What is the capital of Cameroon? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}</s>"
"<s>Parse Was Natalie Portman born in the United States? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37876 wdt:P19 ?uri . ?uri wdt:P17 wd:Q30 . }</s>"
"<s>Parse Who is the oldest child of Meryl Streep? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1</s>"
"<s>Parse Which television shows were created by Walt Disney? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }</s>"
"<s>Parse Was U.S. president Jackson involved in a war? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q11817> <http://www.wikidata.org/prop/direct/P607> ?uri . }</s>"
"<s>Parse When was the Titanic completed? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q25173 wdt:P729 ?date . }</s>"
"<s>Parse Did Tesla win a nobel prize in physics? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }</s>"
"<s>Parse How many states are in Mexico? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri wdt:P31 wd:Q15149663 . }</s>"
"<s>Parse Which scientist is known for the Manhattan Project and the Nobel Peace Prize? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }</s>"
"<s>Parse How much did the Lego Movie cost? to
SPARQL wikidata:
SELECT DISTINCT ?val WHERE {  <http://www.wikidata.org/entity/Q2608065> <http://www.wikidata.org/prop/direct/P2130> ?val }</s>"
"<s>Parse Who composed the music for Harold and Maude? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q368577 wdt:P86 ?uri . }</s>"
"<s>Parse List all episodes of the first season of the HBO television series The Sopranos. to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q21191270> . ?uri <http://www.wikidata.org/prop/direct/P361> <http://www.wikidata.org/entity/Q5274359> } </s>"
"<s>Parse Which city has the least inhabitants? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 ; wdt:P1082 ?population . } ORDER BY ?population LIMIT 1</s>"
"<s>Parse Where is Syngman Rhee buried? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . }</s>"
"<s>Parse Does Neymar play for Real Madrid? to
SPARQL wikidata:
ASK WHERE {  <http://www.wikidata.org/entity/Q142794> <http://www.wikidata.org/prop/direct/P54> <http://www.wikidata.org/entity/Q8682>}</s>"
"<s>Parse Do Prince Harry and Prince William have the same parents? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }</s>"
"<s>Parse Who was the doctoral supervisor of Albert Einstein? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q937> <http://www.wikidata.org/prop/direct/P184> ?uri}</s>"
"<s>Parse Does Breaking Bad have more episodes than Game of Thrones? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1079 wdt:P1113 ?nBbEpisodes . wd:Q23572 wdt:P1113 ?nGotEpisodes . FILTER(?nBbEpisodes > ?nGotEpisodes) }</s>"
"<s>Parse Who was Vincent van Gogh inspired by? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5582> <http://www.wikidata.org/prop/direct/P737> ?uri . }</s>"
"<s>Parse Which building after the Burj Khalifa has the most floors? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12495 wdt:P1101 ?bkFloors . ?uri wdt:P1101 ?otherFloors . FILTER (?otherFloors > ?bkFloors) } ORDER BY ?otherFloors LIMIT 1</s>"
"<s>Parse How much did Pulp Fiction cost? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?value WHERE { wd:Q104123 wdt:P2130 ?value . }</s>"
"<s>Parse Is proinsulin a protein? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426173 wdt:P31/wdt:P279* wd:Q8054 . }</s>"
"<s>Parse Do Urdu and Persian have a common root? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1617 wdt:P279 ?uri . wd:Q9168 wdt:P279 ?uri . }</s>"
"<s>Parse Who is starring in Spanish movies produced by Benicio del Toro? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . }</s>"
"<s>Parse Is Lake Baikal bigger than the Great Bear Lake? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P2046> ?area1 . <http://www.wikidata.org/entity/Q5525> <http://www.wikidata.org/prop/direct/P2046> ?area2 . FILTER(?area1 > ?area2) }</s>"
"<s>Parse Show me all books in Asimov's Foundation series. to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }</s>"
"<s>Parse Where was Bach born? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1339 wdt:P19 ?uri . }</s>"
"<s>Parse Which city has the oldest running metro? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?metro wdt:P31 wd:Q5503 ; wdt:P571 ?inception ; wdt:P131 ?uri . } ORDER BY ?inception LIMIT 1</s>"
"<s>Parse Who designed the Brooklyn Bridge? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . }</s>"
"<s>Parse How many people live in Eurasia? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q5401 wdt:P1082 ?val . }</s>"
"<s>Parse What is the total population of Melbourne, Florida? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q949779 wdt:P1082 ?val . }</s>"
"<s>Parse What country is Mount Everest in? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q513 wdt:P17 ?uri . }</s>"
"<s>Parse To which artistic movement did the painter of The Three Dancers belong? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }</s>"
"<s>Parse When did Operation Overlord commence? to
SPARQL wikidata:
SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q8641370> <http://www.wikidata.org/prop/direct/P580> ?date  . }</s>"
"<s>Parse What is the bridge with the longest span? to
SPARQL wikidata:
PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q12280 ; p:P2787 ?statement . ?statement psv:P2787 ?value . ?value wikibase:quantityAmount ?len . ?value wikibase:quantityUnit ?unit . BIND(IF(?unit = wd:Q11573, ?len, IF(?unit = wd:Q3710,?len*0.3048, IF(?unit = wd:Q253276,?len*1609.34,IF(?unit = wd:Q828224,?len*1000, ?len)))) AS ?lenUnified) } ORDER BY DESC(?lenUnified) LIMIT 1</s>"
"<s>Parse Is there a video game called Battle Chess? to
SPARQL wikidata:
prefix rdfs:   <http://www.w3.org/2000/01/rdf-schema#>  ASK WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7889> . ?uri rdfs:label ""Battle Chess""@en }</s>"
"<s>Parse Who was buried in the Great Pyramid of Giza? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . }</s>"
"<s>Parse Did Socrates influence Aristotle? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P737 wd:Q913 . }</s>"
"<s>Parse How many children did Benjamin Franklin have? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q34969 wdt:P40 ?uri . }</s>"
"<s>Parse How tall is Michael Jordan? to
SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q41421 wdt:P2048 ?val . }</s>"
"<s>Parse In which UK city are the headquarters of the MI6? to
SPARQL wikidata:
SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q184560> <http://www.wikidata.org/prop/direct/P159> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> . }</s>"
"<s>Parse Who created Family Guy? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5930> <http://www.wikidata.org/prop/direct/P170> ?uri}</s>"
"<s>Parse Give me the grandchildren of Elvis Presley. to
SPARQL wikidata:
 SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }</s>"
"<s>Parse When did the Ming dynasty dissolve? to
SPARQL wikidata:
SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9903> <http://www.wikidata.org/prop/direct/P576> ?date . }</s>"
"<s>Parse In which military conflicts did Lawrence of Arabia participate? to
SPARQL wikidata:
 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q170596>  <http://www.wikidata.org/prop/direct/P607>  ?o1 .  } </s>"
"<s>Parse What is the timezone in San Pedro de Atacama? to
SPARQL wikidata:
 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q187893>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  } </s>"
"<s>Parse What did Bruce Carver die from? to
SPARQL wikidata:
SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q4977246>  <http://www.wikidata.org/prop/direct/P509>  ?o1 .  }</s>"
"<s>Parse Does Abraham Lincoln's death place have a website? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }  </s>"
"<s>Parse Did Elvis Presley have children? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q303> <http://www.wikidata.org/prop/direct/P40> ?uri }</s>"
"<s>Parse Is Michelle Obama the wife of Barack Obama? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q76>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q13133> . }</s>"
"<s>Parse In which city does Sylvester Stallone live? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q40026> <http://www.wikidata.org/prop/direct/P551> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }</s>"
"<s>Parse Which books by Kerouac were published by Viking Press? to
SPARQL wikidata:
 SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P123>  <http://www.wikidata.org/entity/Q921536> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q47461344> . ?s1  <http://www.wikidata.org/prop/direct/P50>  <http://www.wikidata.org/entity/Q160534> . }</s>"
"<s>Parse Who wrote the song Hotel California? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q780394> <http://www.wikidata.org/prop/direct/P86> ?uri}</s>"
"<s>Parse What is the capital of Canada? to
SPARQL wikidata:
SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 .  }</s>"
"<s>Parse Who is the mayor of Tel Aviv? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q33935> <http://www.wikidata.org/prop/direct/P6> ?uri . }</s>"
"<s>Parse What form of government does Russia have? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q159> <http://www.wikidata.org/prop/P122> ?q . ?q <http://www.wikidata.org/prop/statement/P122> ?uri . FILTER NOT EXISTS { ?q <http://www.wikidata.org/prop/qualifier/P582> ?x }} </s>"
"<s>Parse Show me the book that Muhammad Ali wrote. to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }</s>"
"<s>Parse Who was the first to climb Mount Everest? to
SPARQL wikidata:
SELECT ?s WHERE { ?b ps:P793   <http://www.wikidata.org/entity/Q1194369> . ?b pq:P642 <http://www.wikidata.org/entity/Q513> . ?s p:P793 ?b   . }</s>"
"<s>Parse How many languages are spoken in Colombia? to
SPARQL wikidata:
 SELECT (COUNT(?s1) as ?c) WHERE { ?s1  ?p1  <http://www.wikidata.org/entity/Q739> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q34770> .  }</s>"
"<s>Parse What is the currency of the Czech Republic? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q213> <http://www.wikidata.org/prop/direct/P38> ?uri . }</s>"
"<s>Parse When did Boris Becker end his active career? to
SPARQL wikidata:
SELECT DISTINCT ?date WHERE {  <http://www.wikidata.org/entity/Q76334> <http://www.wikidata.org/prop/P106>/<http://www.wikidata.org/prop/qualifier/P582> ?date }</s>"
"<s>Parse Which movies starring Mickey Rourke were directed by Guy Ritchie? to
SPARQL wikidata:
SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q178552> .  ?s1  <http://www.wikidata.org/prop/direct/P57>  <http://www.wikidata.org/entity/Q192990> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . }</s>"
"<s>Parse In which films did Julia Roberts as well as Richard Gere play? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q48410> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . }</s>"
"<s>Parse Show me Hemingway's autobiography. to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }</s>"
"<s>Parse What are the five boroughs of New York? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q408804> . }</s>"
"<s>Parse Give me all Canadian Grunge record labels. to
SPARQL wikidata:
 SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }</s>"
"<s>Parse In which country does the Ganges start? to
SPARQL wikidata:
 SELECT ?o2 WHERE { <http://www.wikidata.org/entity/Q5089>  <http://www.wikidata.org/prop/direct/P885>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  ?o2 .  } </s>"
"<s>Parse Who is the founder of Penguin Books? to
SPARQL wikidata:
SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q1336200>  <http://www.wikidata.org/prop/direct/P112>  ?o1 .  }</s>"
"<s>Parse Who wrote the Game of Thrones theme? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q23572> <http://www.wikidata.org/prop/direct/P86> ?uri . }</s>"
"<s>Parse Who is the president of Eritrea? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q986> <http://www.wikidata.org/prop/direct/P35> ?uri}</s>"
"<s>Parse Give me the currency of China. to
SPARQL wikidata:
SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } </s>"
"<s>Parse Give me all Swedish oceanographers. to
SPARQL wikidata:
SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  }</s>"
"<s>Parse In which city are the headquarters of the United Nations? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q11297> <http://www.wikidata.org/prop/direct/P131> ?uri . { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . } UNION {?uri <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q515> . } }</s>"
"<s>Parse Is Rita Wilson the wife of Tom Hanks? to
SPARQL wikidata:
ASK WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q234144> . } </s>"
"<s>Parse In which countries do people speak Japanese? to
SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> <http://www.wikidata.org/entity/Q5287> . } </s>"
"<s>Parse Which of Tim Burton's films had the highest budget? to
SPARQL wikidata:
 SELECT DISTINCT ?s1 WHERE {    ?s1  ?p1  <http://www.wikidata.org/entity/Q56008> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> .  ?s1  <http://www.wikidata.org/prop/direct/P2769> ?o1 } order by ?o1 limit 1</s>"
"<s>Parse Which museum in New York has the most visitors? to
SPARQL wikidata:
 SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P159>  <http://www.wikidata.org/entity/Q60> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q33506> . ?s1  <http://www.wikidata.org/prop/direct/P1174> ?o1 } order by ?o1 limit 1</s>"
"<s>Parse What was the last movie with Alec Guinness? to
SPARQL wikidata:
SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1</s>"
"<s>Parse Koks buvo paskutinis filmas su Alec Guinness to
SPARQL wikidata:
SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1</s>"
"<s>Parse Give me all actors starring in Last Action Hero. to
SPARQL wikidata:
SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } </s>"
"<s>Parse Sudarykite visų „Paskutinio veiksmo herojaus“ aktorių sąrašą. to
SPARQL wikidata:
SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } </s>"
"<s>Parse Who discovered Pluto? to
SPARQL wikidata:
SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q339>  <http://www.wikidata.org/prop/direct/P61>  ?o1 .   ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> .  } </s>"
