text
"Show me all basketball players that are higher than 2 meters.
<s>SPARQL
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"Liste alle Basketballspieler auf, die größer als 2 Meter sind.
<s>SPARQL
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"Montrez-moi tous les joueurs de basketball qui font plus de 2 mètres.
<s>SPARQL
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"Pasakyk man visus plaukikus, gimusius Maskvoje.
<s>SPARQL
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }</s>"
"Sudarykite visų „Paskutinio veiksmo herojaus“ aktorių sąrašą.
<s>SPARQL
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }</s>"
