text
"<s>Parse List all boardgames by GMT. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT ?uri WHERE { ?uri dbo:publisher res:GMT_Games }</s>"
"<s>Parse Who developed Skype? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Skype dbo:developer ?uri. }</s>"
"<s>Parse Which people were born in Heraklion? to
SPARQL dbpedia:
PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX onto: <http://dbpedia.org/ontology/> SELECT DISTINCT ?uri WHERE { ?uri rdf:type onto:Person ; onto:birthPlace <http://dbpedia.org/resource/Heraklion>. }</s>"
"<s>Parse In which U.S. state is Area 51 located? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:Area_51 dbo:location ?uri . ?uri dbo:country res:United_States. }</s>"
"<s>Parse Who is the mayor of New York City? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:New_York_City dbo:leaderName ?uri }</s>"
"<s>Parse Which airports does Air China serve? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Air_China dbo:targetAirport ?uri }</s>"
"<s>Parse Give me all actors starring in movies directed by and starring William Shatner. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { ?x dbo:director res:William_Shatner ; dbo:starring res:William_Shatner { ?x dbo:starring ?uri } UNION { ?x dbp:starring ?uri } }</s>"
"<s>Parse What are the official languages of the Philippines? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Philippines dbo:officialLanguage ?uri }</s>"
"<s>Parse Give me all Danish films. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:country res:Denmark }</s>"
"<s>Parse Which movies starring Brad Pitt were directed by Guy Ritchie? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Film ; dbo:starring res:Brad_Pitt ; dbo:director res:Guy_Ritchie }</s>"
"<s>Parse Give me the grandchildren of Bruce Lee. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Bruce_Lee dbo:child ?child . ?child <http://dbpedia.org/property/children> ?uri }</s>"
"<s>Parse Which other weapons did the designer of the Uzi develop? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Weapon ; dbp:designer ?x . res:Uzi dbp:designer ?x FILTER ( ?uri != res:Uzi ) }</s>"
"<s>Parse Who is the owner of Universal Studios? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Universal_Studios dbo:owner ?uri }</s>"
"<s>Parse Which state of the USA has the highest population density? to
SPARQL dbpedia:
PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:densityrank ?rank } ORDER BY ASC(?rank) LIMIT 1</s>"
"<s>Parse Which monarchs were married to a German? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Monarch ; dbo:spouse ?spouse { ?spouse dbo:birthPlace res:Germany } UNION { ?spouse dbo:birthPlace ?p . ?p dbo:country res:Germany } }</s>"
"<s>Parse Who created the comic Captain America? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Captain_America dbo:creator ?uri }</s>"
"<s>Parse Give me the Apollo 14 astronauts. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:mission res:Apollo_14 }</s>"
"<s>Parse Who wrote the book The pillars of the Earth? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> SELECT DISTINCT ?uri WHERE { res:The_Pillars_of_the_Earth dbo:author ?uri }</s>"
"<s>Parse Which state of the United States of America has the highest density? to
SPARQL dbpedia:
PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT ?uri WHERE { ?uri dbp:densityrank ?density } ORDER BY ASC(?density) LIMIT 1</s>"
"<s>Parse Which spaceflights were launched from Baikonur? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/launchPad> res:Baikonur_Cosmodrome }</s>"
"<s>Parse Give me a list of all trumpet players that were bandleaders. to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:occupation res:Bandleader ; dbo:instrument res:Trumpet }</s>"
"<s>Parse Which U.S. states are in the same timezone as Utah? to
SPARQL dbpedia:
PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { res:Utah dbp:timezone ?x . ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:timezone ?x FILTER ( ?uri != res:Utah ) }</s>"
"<s>Parse Which U.S. states possess gold minerals? to
SPARQL dbpedia:
PREFIX yago: <http://dbpedia.org/class/yago/> PREFIX dbp: <http://dbpedia.org/property/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type yago:WikicatStatesOfTheUnitedStates ; dbp:mineral ?mineral FILTER regex(?mineral, ""gold"", ""i"") }</s>"
"<s>Parse Who is the daughter of Ingrid Bergman married to? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Ingrid_Bergman dbo:child ?child . ?child <http://dbpedia.org/property/spouse> ?uri }</s>"
"<s>Parse How deep is Lake Placid? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Lake_Placid_(Texas)> dbo:maximumDepth ?n }</s>"
"<s>Parse Show me all museums in London. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/London> }</s>"
"<s>Parse Which caves have more than 3 entrances? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Cave> ; <http://dbpedia.org/property/entranceCount> ?entrance FILTER ( ?entrance > 3 ) }</s>"
"<s>Parse Who is the tallest player of the Atlanta Falcons? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/team> <http://dbpedia.org/resource/Atlanta_Falcons> ; <http://dbpedia.org/ontology/height> ?h } ORDER BY DESC(?h) OFFSET 0 LIMIT 1</s>"
"<s>Parse Show me all basketball players that are higher than 2 meters. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Parse Muéstrame todos los jugadores de baloncesto que miden más de 2 metros de altura to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Parse Liste alle Basketballspieler auf, die größer als 2 Meter sind. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Parse Montrez-moi tous les joueurs de basketball qui font plus de 2 mètres. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Parse When was the Statue of Liberty built? to
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Statue_of_Liberty> <http://dbpedia.org/property/beginningDate> ?date }</s>"
"<s>Parse Which states border Illinois? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Illinois> <http://dbpedia.org/property/borderingstates> ?uri }</s>"
"<s>Parse Who developed Minecraft? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Minecraft> <http://dbpedia.org/ontology/developer> ?uri }</s>"
"<s>Parse Where did Hillel Slovak die? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Hillel_Slovak> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Parse What movies does Jesse Eisenberg play in? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Jesse_Eisenberg> }</s>"
"<s>Parse Give all swimmers that were born in Moscow. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }</s>"
"<s>Parse Pasakyk man visus plaukikus, gimusius Maskvoje. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }</s>"
"<s>Parse Which presidents were born in 1945? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/President> ; <http://dbpedia.org/ontology/birthDate> ?date FILTER regex(?date, ""^1945"") }</s>"
"<s>Parse What kind of music did Lou Reed play? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lou_Reed> <http://dbpedia.org/ontology/genre> ?uri }</s>"
"<s>Parse Where do the Red Sox play? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Boston_Red_Sox> <http://dbpedia.org/property/ballpark> ?uri }</s>"
"<s>Parse Show a list of soccer clubs that play in the Bundesliga. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Bundesliga> }</s>"
"<s>Parse Which bridges cross the Seine? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Bridge> ; <http://dbpedia.org/ontology/crosses> <http://dbpedia.org/resource/Seine> }</s>"
"<s>Parse How many films did Hal Roach produce? to
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }</s>"
"<s>Parse Give me all Danish movies. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> }</s>"
"<s>Parse What is the most frequent cause of death? to
SPARQL dbpedia:
SELECT DISTINCT ?x WHERE { ?uri <http://dbpedia.org/ontology/deathCause> ?x . } ORDER BY DESC(COUNT(DISTINCT ?uri)) OFFSET 0 LIMIT 1</s>"
"<s>Parse Who are the four youngest MVP basketball players? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4</s>"
"<s>Parse Wer sind die vier jüngsten MVP Spieler im Basketball? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/birthDate> ?date ; <http://dbpedia.org/property/highlights> ?h FILTER regex(?h, ""MVP"") } ORDER BY DESC(?date) OFFSET 0 LIMIT 4</s>"
"<s>Parse Give me the capitals of all countries that the Himalayas run through. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?country . ?country <http://dbpedia.org/ontology/capital> ?uri }</s>"
"<s>Parse How many movies did Park Chan-wook direct? to
SPARQL dbpedia:
SELECT COUNT(DISTINCT ?uri AS ?uri) WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Park_Chan-wook> . }</s>"
"<s>Parse How many airlines are there? to
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> }</s>"
"<s>Parse Give me all islands that belong to Japan. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Island> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Japan> }</s>"
"<s>Parse How many inhabitants does Maribor have? to
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Maribor> <http://dbpedia.org/ontology/populationTotal> ?num }</s>"
"<s>Parse Give me all Apollo 14 astronauts. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/mission> <http://dbpedia.org/resource/Apollo_14> }</s>"
"<s>Parse Which companies have more than 1 million employees? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Company> { ?uri <http://dbpedia.org/ontology/numberOfEmployees> ?n } UNION { ?uri <http://dbpedia.org/property/numEmployees> ?n } FILTER ( ?n > 1000000 ) }</s>"
"<s>Parse Give me all soccer clubs in the Premier League. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerClub> ; <http://dbpedia.org/ontology/league> <http://dbpedia.org/resource/Premier_League> }</s>"
"<s>Parse What is the highest place of the Urals? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Ural_Mountains> <http://dbpedia.org/property/highest> ?uri }</s>"
"<s>Parse Who is the governor of Wyoming? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Wyoming> <http://dbpedia.org/property/governor> ?uri }</s>"
"<s>Parse Where did the architect of the Eiffel Tower study? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Eiffel_Tower> <http://dbpedia.org/ontology/architect> ?x . ?x <http://dbpedia.org/property/almaMater> ?uri }</s>"
"<s>Parse Which movies star both Liz Taylor and Richard Burton? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Elizabeth_Taylor> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Richard_Burton> }</s>"
"<s>Parse Which pope succeeded John Paul II? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Pope_John_Paul_II> <http://dbpedia.org/property/successor> ?uri }</s>"
"<s>Parse Give me all ESA astronauts. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Astronaut> ; <http://dbpedia.org/property/type> <http://dbpedia.org/resource/European_Space_Agency> }</s>"
"<s>Parse Who was president of Pakistan in 1978? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/title> <http://dbpedia.org/resource/President_of_Pakistan> ; <http://dbpedia.org/property/years> 1978 }</s>"
"<s>Parse Who is the owner of Rolls-Royce? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Rolls-Royce_Motors> <http://dbpedia.org/ontology/owner> ?uri }</s>"
"<s>Parse How many museums does Paris have? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> }</s>"
"<s>Parse Where was JFK assassinated? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Parse Which beer originated in Ireland? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Parse To which countries does the Himalayan mountain system extend? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>Parse How much carbs does peanut butter have? to
SPARQL dbpedia:
SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs }</s>"
"<s>Parse Who produced the most films? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Parse How many employees does Google have? to
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num }</s>"
"<s>Parse Give me all actors who were born in Berlin. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Berlin> }</s>"
"<s>Parse Who created Goofy? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }</s>"
"<s>Parse Which music albums contain the song Last Christmas? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>Parse When was Alberta admitted as province? to
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Parse How many missions does the Soyuz programme have? to
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Parse Give me all the TV shows with Neil Patrick Harris. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }</s>"
"<s>Parse When were the Hells Angels founded? to
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>Parse What is the net income of Apple? to
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Parse Give me all Swedish holidays. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }</s>"
"<s>Parse In which city was the former Dutch queen Juliana buried? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>Parse List all the musicals with music by Leonard Bernstein. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Musical> ; <http://dbpedia.org/ontology/musicBy> <http://dbpedia.org/resource/Leonard_Bernstein> }</s>"
"<s>Parse What is the largest metropolitan area in Washington state? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Parse Who killed John Lennon? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>Parse Give me all types of eating disorders. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }</s>"
"<s>Parse Was Marc Chagall a jew? to
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }</s>"
"<s>Parse What was Brazil's lowest rank in the FIFA World Ranking? to
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n }</s>"
"<s>Parse How many films did Leonardo DiCaprio star in? to
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }</s>"
"<s>Parse Was Margaret Thatcher a chemist? to
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> }</s>"
"<s>Parse Give me all books written by Danielle Steel. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Book> ; <http://dbpedia.org/ontology/author> <http://dbpedia.org/resource/Danielle_Steel> }</s>"
"<s>Parse What is the total amount of men and women serving in the FDNY? to
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }</s>"
"<s>Parse Which actor played Chewbacca? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>Parse Which ships were called after Benjamin Franklin? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/shipNamesake> <http://dbpedia.org/resource/Benjamin_Franklin> }</s>"
"<s>Parse Give me all Methodist politicians. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Politician> ; <http://dbpedia.org/ontology/religion> <http://dbpedia.org/resource/Methodism> }</s>"
"<s>Parse What other books have been written by the author of The Fault in Our Stars? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> SELECT ?books WHERE { ?books dbo:author <http://dbpedia.org/resource/John_Green_(author)> }</s>"
"<s>Parse What is the highest mountain? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 0 LIMIT 1</s>"
"<s>Parse Which programming languages influenced Javascript? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> ; <http://dbpedia.org/ontology/influenced> <http://dbpedia.org/resource/JavaScript> }</s>"
"<s>Parse Which films starring Clint Eastwood did he direct himself? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/Clint_Eastwood> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Clint_Eastwood> }</s>"
"<s>Parse How many airlines are members of the Star Alliance? to
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Airline> ; <http://dbpedia.org/ontology/alliance> <http://dbpedia.org/resource/Star_Alliance> }</s>"
"<s>Parse Who wrote The Hunger Games? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/The_Hunger_Games> <http://dbpedia.org/property/author> ?uri }</s>"
"<s>Parse For which label did Elvis record his first album? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?x rdf:type dbo:Album ; dbo:artist res:Elvis_Presley ; dbo:releaseDate ?y ; dbo:recordLabel ?uri } ORDER BY ASC(?y) OFFSET 0 LIMIT 1</s>"
"<s>Parse Is Christian Bale starring in Batman Begins? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> ASK WHERE { res:Batman_Begins dbo:starring res:Christian_Bale }</s>"
"<s>Parse Where is the residence of the prime minister of Spain? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Prime_Minister_of_Spain> <http://dbpedia.org/property/residence> ?uri }</s>"
"<s>Parse Which countries have more than two official languages? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> ; <http://dbpedia.org/ontology/officialLanguage> ?language } GROUP BY ?uri HAVING ( COUNT(?language) > 2 )</s>"
"<s>Parse Which television shows were created by John Cleese? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/creator> <http://dbpedia.org/resource/John_Cleese> }</s>"
"<s>Parse When did Latvia join the EU? to
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Latvia> <http://dbpedia.org/property/accessioneudate> ?date }</s>"
"<s>Parse Which soccer players were born on Malta? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/SoccerPlayer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Malta> }</s>"
"<s>Parse Give me the birthdays of all actors of the television show Charmed. to
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Charmed> <http://dbpedia.org/ontology/starring> ?actor . ?actor <http://dbpedia.org/ontology/birthDate> ?date }</s>"
"<s>Parse Give me a list of all lakes in Denmark. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { { ?uri a <http://dbpedia.org/ontology/Lake> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Denmark> } UNION { ?uri a <http://dbpedia.org/class/yago/LakesOfDenmark> } }</s>"
"<s>Parse How many children does Eddie Murphy have? to
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Eddie_Murphy> <http://dbpedia.org/property/children> ?n }</s>"
"<s>Parse Who is the manager of Real Madrid? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Real_Madrid_C.F.> <http://dbpedia.org/ontology/manager> ?uri }</s>"
"<s>Parse In which countries can you pay using the West African CFA franc? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/West_African_CFA_franc> }</s>"
"<s>Parse Which holidays are celebrated around the world? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> SELECT DISTINCT ?uri WHERE { ?uri rdf:type dbo:Holiday }</s>"
"<s>Parse What is the longest river? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/River> { ?uri <http://dbpedia.org/ontology/length> ?l } UNION { ?uri <http://dbpedia.org/property/length> ?l } } ORDER BY DESC(?l) OFFSET 0 LIMIT 1</s>"
"<s>Parse What is the birth name of Angela Merkel? to
SPARQL dbpedia:
SELECT DISTINCT ?string WHERE { <http://dbpedia.org/resource/Angela_Merkel> <http://dbpedia.org/property/birthName> ?string }</s>"
"<s>Parse Who has Tom Cruise been married to? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/spouse> <http://dbpedia.org/resource/Tom_Cruise> }</s>"
"<s>Parse Which weapons did Heckler & Koch develop? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Weapon> ; <http://dbpedia.org/property/designer> <http://dbpedia.org/resource/Heckler_&_Koch> }</s>"
"<s>Parse What is the smallest city by area in Germany? to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX skos: <http://www.w3.org/2004/02/skos/core#> PREFIX dbc: <http://dbpedia.org/resource/Category:> PREFIX dct: <http://purl.org/dc/terms/> SELECT ?city WHERE { ?m skos:broader dbc:Cities_in_Germany . ?city dct:subject ?m ; dbo:areaTotal ?area } ORDER BY ?area LIMIT 1</s>"
"<s>Parse What is the ruling party in Lisbon? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Lisbon> <http://dbpedia.org/property/leaderParty> ?uri }</s>"
"<s>Parse How heavy is Jupiter's lightest moon? to
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { ?uri <http://dbpedia.org/property/satelliteOf> <http://dbpedia.org/resource/Jupiter> ; <http://dbpedia.org/ontology/mass> ?n } ORDER BY ASC(?n) OFFSET 0 LIMIT 1</s>"
"<s>Parse How many employees does IBM have? to
SPARQL dbpedia:
SELECT DISTINCT ?number WHERE { <http://dbpedia.org/resource/IBM> <http://dbpedia.org/ontology/numberOfEmployees> ?number }</s>"
"<s>Parse List all episodes of the first season of the HBO television series The Sopranos! to
SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { ?uri dbo:series res:The_Sopranos ; dbo:seasonNumber 1 }</s>"
"<s>Parse What does ICRO stand for? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/abbreviation> ""ICRO"" }</s>"
"<s>Parse Give me all films produced by Hal Roach. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/producer> <http://dbpedia.org/resource/Hal_Roach> }</s>"
"<s>Parse Who played Agent Smith in Matrix? to
SPARQL dbpedia:
PREFIX res: <http://dbpedia.org/resource/> PREFIX dbp: <http://dbpedia.org/property/> SELECT DISTINCT ?uri WHERE { res:Agent_Smith <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>Parse Give me a list of all bandleaders that play trumpet. to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/occupation> <http://dbpedia.org/resource/Bandleader> ; <http://dbpedia.org/ontology/instrument> <http://dbpedia.org/resource/Trumpet> }</s>"
"<s>Parse What is the second highest mountain on Earth? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Mountain> ; <http://dbpedia.org/ontology/elevation> ?elevation } ORDER BY DESC(?elevation) OFFSET 1 LIMIT 1</s>"
"<s>Parse Is Egypts largest city also its capital? to
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Egypt> <http://dbpedia.org/ontology/largestCity> ?large ; <http://dbpedia.org/ontology/capital> ?capital FILTER ( ?large = ?capital ) }</s>"
"<s>Parse Which rockets were launched from Baikonur? to
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Rocket> ; <http://dbpedia.org/ontology/launchSite> <http://dbpedia.org/resource/Baikonur_Cosmodrome> }</s>"
