text
"<s>Show me all basketball players that are higher than 2 meters.
Translate to SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Liste alle Basketballspieler auf, die größer als 2 Meter sind.
Translate to SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Montrez-moi tous les joueurs de basketball qui font plus de 2 mètres.
Translate to SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/BasketballPlayer> ; <http://dbpedia.org/ontology/height> ?n FILTER ( ?n > 2.0 ) }</s>"
"<s>Pasakyk man visus plaukikus, gimusius Maskvoje.
Translate to SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Swimmer> ; <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Moscow> }</s>"
"<s>Sudarykite visų „Paskutinio veiksmo herojaus“ aktorių sąrašą.
Translate to SPARQL dbpedia:
PREFIX dbo: <http://dbpedia.org/ontology/> PREFIX res: <http://dbpedia.org/resource/> SELECT DISTINCT ?uri WHERE { res:Last_Action_Hero dbo:starring ?uri }</s>"
"<s>Show me all basketball players that are higher than 2 meters.
Translate to SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}</s>"
"<s>Liste alle Basketballspieler auf, die größer als 2 Meter sind.
Translate to SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}</s>"
"<s>Montrez-moi tous les joueurs de basketball qui font plus de 2 mètres.
Translate to SPARQL wikidata:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}</s>"
"<s>Pasakyk man visus plaukikus, gimusius Maskvoje.
Translate to SPARQL wikidata:
PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }</s>"
"<s>Koks buvo paskutinis filmas su Alec Guinness
Translate to SPARQL wikidata:
SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1</s>"
"<s>Sudarykite visų „Paskutinio veiksmo herojaus“ aktorių sąrašą.
Translate to SPARQL wikidata:
SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } </s>"
