text
"<s>Сколько всего музеев в Париже?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> }</s>"
"<s>Kiek muziejų Paryžiuje?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> }</s>"
"<s>Скільки музеїв в Парижі?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Museum> ; <http://dbpedia.org/ontology/location> <http://dbpedia.org/resource/Paris> }</s>"
"<s>¿Dónde fue asesinado JFK?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Где был убит Кеннеди?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Où a été assassiné JFK ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Kur buvo nužudytas Džonas Kenedis?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>Де був вбитий Джон Кеннеди?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/John_F._Kennedy> <http://dbpedia.org/ontology/deathPlace> ?uri }</s>"
"<s>¿Qué personas nacieron en Halloween?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> { ?uri <http://dbpedia.org/ontology/birthDate> ?date } UNION { ?uri <http://dbpedia.org/property/birthDate> ?date } <http://dbpedia.org/resource/Halloween> <http://dbpedia.org/property/date> ?date }</s>"
"<s>¿Qué cerveza es originaria de Irlanda?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Welche Biersorten haben ihren Ursprung in Irland?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Какое пиво происходит из Ирландии?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Quelle bière est originaire d'Irlande ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Koks alus buvo sukurtas Airijoje?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Яке пиво було створене в Ірландії?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/property/type> <http://dbpedia.org/resource/Beer> ; <http://dbpedia.org/ontology/origin> <http://dbpedia.org/resource/Beer_in_Ireland> }</s>"
"<s>Auf welche Länder erstreckt sich das Himalaya-Gebirge?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>До каких стран просираются горы Гималаев?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>Dans quels pays s'étend le système montagneux de l'Himalaya ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>Per kokias šalis Hymalajų kalnų sistema yra nusidriekusi?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>На території яких країн знаходяться Гімалаї?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Himalayas> <http://dbpedia.org/ontology/country> ?uri }</s>"
"<s>¿Qué actores son originarios de Alemania?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>Welche Schauspieler wurden in Deutschland geboren?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>Какие актеры были рождены в Германии?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>Quels acteurs sont nés en Allemagne ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>Kokie aktoriai yra gimę Vokietijoje?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>Які актори народилися у Німетчині?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Actor> { ?uri <http://dbpedia.org/ontology/birthPlace> <http://dbpedia.org/resource/Germany> } UNION { ?uri <http://dbpedia.org/ontology/birthPlace> ?place . ?place <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Germany> } }</s>"
"<s>¿Cuántos carbohidratos tiene la mantequilla de maní?
SPARQL dbpedia:
SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs }</s>"
"<s>Сколько углеводов в арахисовом масле?
SPARQL dbpedia:
SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs }</s>"
"<s>Kiek angliavandenių yra žemės riešutų svieste?
SPARQL dbpedia:
SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs }</s>"
"<s>Який вміст вуглеводів в арахісовому маслі?
SPARQL dbpedia:
SELECT DISTINCT ?carbs WHERE { <http://dbpedia.org/resource/Peanut_butter> <http://dbpedia.org/property/carbs> ?carbs }</s>"
"<s>¿Quién ha producido la mayor cantidad de películas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Wer hat die meisten Filme produziert?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Кто продюссировал больше всего фильмов?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Qui a produit le plus de films ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Kas sukūrė daugiausiai filmų?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Хто знімає найбільшу кількість фільмів?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?film <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Film> . ?film <http://dbpedia.org/ontology/producer> ?uri . } ORDER BY DESC(COUNT(?film)) OFFSET 0 LIMIT 1</s>"
"<s>Как много наемных работников в Google?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num }</s>"
"<s>Combien d'employés compte Google ?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num }</s>"
"<s>Kiek darbuotojų dirba „Google“?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num }</s>"
"<s>Скільки співробітників праціє в Google?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/Google> <http://dbpedia.org/ontology/numberOfEmployees> ?num }</s>"
"<s>Wer hat Goofy erschaffen?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }</s>"
"<s>Хто створив персонажа Гуфі?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Goofy> <http://dbpedia.org/ontology/creator> ?uri }</s>"
"<s>¿Qué álbumes musicales contienen la canción Last Christmas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>Auf welchen Musikalben befindet sich das Lied Last Christmas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>Какой альбом содержит песню Last Christmas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>Quels albums musicaux contiennent la chanson Last Christmas ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>Kuriuose muzikos albumuose yra daina „Last Christmas“?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>До складу яких альбомів входить пісня Last Christmas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?single <http://dbpedia.org/ontology/album> ?uri ; <http://www.w3.org/2000/01/rdf-schema#label> ""Last Christmas""@en }</s>"
"<s>¿Cuándo fue admitida como provincia Alberta?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Wann wurde Alberta zu einer Provinz?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Когда Альберта была признана провинцией?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Quand l'Alberta a-t-elle été admise comme province ?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Kuriais metais Albertas buvo pripažintas provincija?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>Коли Альберту було визнано провінцією?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Alberta> <http://dbpedia.org/property/admittancedate> ?date }</s>"
"<s>¿Cuántas misiones tiene el programa Soyuz?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Wie viele Missionen hat das Soyuz-Programm?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Сколько миссий у программы Союз?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Combien de missions le programme Soyouz compte-t-il ?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Kiek misijų turėjo programa Sąjunga?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri <http://dbpedia.org/property/programme> <http://dbpedia.org/resource/Soyuz_programme> }</s>"
"<s>Išvardykite visas TV laidas su Neilu Patricku Harrisu?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/TelevisionShow> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Neil_Patrick_Harris> }</s>"
"<s>¿Cuándo se fundaron los Hells Angels?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>Wann wurden die Berge der Engel gegründet?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>Когда были основаны Ангелы Ада?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>Quand Mont Angeles a été fondée?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>Kada buvo įkurta Hells Angels?
SPARQL dbpedia:
SELECT DISTINCT ?date WHERE { <http://dbpedia.org/resource/Hells_Angels> <http://dbpedia.org/property/founded> ?date }</s>"
"<s>¿Cuánto es el ingreso neto de Apple?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Was ist Apples Nettoeinkommen?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Какова чистая прибыль Эппл?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Quel est le revenu net d'une Apple?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Kokios yra „Apple“ grynosios pajamos?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>Скільки складає чистий дохід компаніі Apple?
SPARQL dbpedia:
SELECT DISTINCT ?ni WHERE { <http://dbpedia.org/resource/Apple_Inc.> <http://dbpedia.org/ontology/netIncome> ?ni }</s>"
"<s>¿Cuáles son los días festivos de Suecia?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }</s>"
"<s>Išvardinti visas Švedijos šventes?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Holiday> ; <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Sweden> }</s>"
"<s>¿En qué ciudad fue enterrada la antigua reina de los Países Bajos Juliana?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>In welcher Stadt wurde die ehemalige dänische Königin Julian begraben?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>В каком городе была рождена бывшая королева Нидерландов - Джулиана?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>Dans quelle ville l'ancienne reine du Danemark Juliana a-t-elle été enterrée?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>Kuriame mieste palaidota buvusi Nyderlandų karalienė Juliana?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>У якому місті була похована колишня голандська королева Юліана?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Juliana_of_the_Netherlands> <http://dbpedia.org/property/burialPlace> ?uri . ?uri a <http://dbpedia.org/ontology/Settlement> }</s>"
"<s>¿Cuál es el área metropolitana más grande en el estado de Washington?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Welche Metropole ist die größte im Washington Staat?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Какова наибольшая городская территория штата Вашингтон?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Quelle est la plus grande métropole de l'état de Washington?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Koks yra didžiausias Vašingtono valstijos miestas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>Який найбільший мегаполіс у штаті Вашингтон?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Washington_(state)> <http://dbpedia.org/property/largestmetro> ?uri }</s>"
"<s>¿Quién asesinó a John Lennon?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>Кто убил Джона Леннона?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>Qui a tué John Lennon?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>Kas nužudė Johną Lennoną?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>Хто вбив Джона Ленона?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Person> ; <http://dbpedia.org/property/conviction> <http://dbpedia.org/resource/Death_of_John_Lennon> }</s>"
"<s>¿Qué escritores estudiaron en Estambul?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } }</s>"
"<s>Какие писатели учились в Стамбуле?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } }</s>"
"<s>Kuris rašytojas studijavo Stambule?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } }</s>"
"<s>Які письменники навчалися в Істамублі?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Writer> { ?uri <http://dbpedia.org/ontology/almaMater> ?x } UNION { ?uri <http://dbpedia.org/ontology/education> ?x } { ?x <http://dbpedia.org/ontology/city> <http://dbpedia.org/resource/Istanbul> } UNION { ?x <http://dbpedia.org/property/city> <http://dbpedia.org/resource/Istanbul> } }</s>"
"<s>¿Qué bandas de metalcore son australianas?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Band> ; <http://dbpedia.org/ontology/genre> <http://dbpedia.org/resource/Metalcore> { ?uri <http://dbpedia.org/ontology/hometown> <http://dbpedia.org/resource/Australia> } UNION { ?uri <http://dbpedia.org/ontology/hometown> ?h . ?h <http://dbpedia.org/ontology/country> <http://dbpedia.org/resource/Australia> } }</s>"
"<s>¿Qué países utilizan el Euro?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }</s>"
"<s>Какие страны используют Евро?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }</s>"
"<s>Quels pays ont adopté l'Euro ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Country> { ?uri <http://dbpedia.org/ontology/currency> <http://dbpedia.org/resource/Euro> } UNION { ?uri <http://dbpedia.org/property/currencyCode> ""EUR""@en } }</s>"
"<s>¿Cuáles son los tipos de trastornos alimenticios?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }</s>"
"<s>Перечислите все расстройсква ЖКТ?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/class/yago/WikicatEatingDisorders> }</s>"
"<s>¿Marc Chagall era judío?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }</s>"
"<s>War Marc Chagall Jude?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }</s>"
"<s>Марк Шагал еврейского происхождения?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }</s>"
"<s>Marc Chagall était-il juif ?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Marc_Chagall> <http://dbpedia.org/property/ethnicity> ""Jewish""@en }</s>"
"<s>¿Cuál ha sido la posición más baja de Brasil en el ranking mundial de la FIFA?
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n }</s>"
"<s>Was ist Brasiliens niedrigster Rang in der FIFA Weltrangliste?
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n }</s>"
"<s>Какое наименьшее место в рейтинге ФИФА занимала Бразилия?
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n }</s>"
"<s>Quel a été le rang le plus bas du Brésil au classement mondial de la FIFA ?
SPARQL dbpedia:
SELECT DISTINCT ?n WHERE { <http://dbpedia.org/resource/Brazil_national_football_team> <http://dbpedia.org/property/fifaMin> ?n }</s>"
"<s>¿En cuántas películas ha actuado Leonardo DiCaprio?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }</s>"
"<s>In wie vielen Filmen hat Leonardo DiCaprio gespielt?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }</s>"
"<s>Dans combien de films Leonardo DiCaprio est la star ?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }</s>"
"<s>Kiek filmų vaidino Leonardo DiCaprio?
SPARQL dbpedia:
SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri a <http://dbpedia.org/ontology/Film> ; <http://dbpedia.org/ontology/starring> <http://dbpedia.org/resource/Leonardo_DiCaprio> }</s>"
"<s>¿Margaret Thatcher era química?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> }</s>"
"<s>War Magret Thatcher eine Chemikerin?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> }</s>"
"<s>Маргарет Тетчер была химиком?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> }</s>"
"<s>Margaret Thatcher était-elle chimiste ?
SPARQL dbpedia:
ASK WHERE { <http://dbpedia.org/resource/Margaret_Thatcher> <http://dbpedia.org/ontology/profession> <http://dbpedia.org/resource/Chemist> }</s>"
"<s>¿Qué estados americanos se encuentran en la misma zona horaria que Utah?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) }</s>"
"<s>Welche US Bundesstaaten haben die gleiche Zeitzone wie Utah?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) }</s>"
"<s>Kuris JAV valstijos yra toje pačioje laiko juostoje kaip Juta?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Utah> <http://dbpedia.org/property/timezone> ?x . ?uri a <http://dbpedia.org/class/yago/WikicatStatesOfTheUnitedStates> ; <http://dbpedia.org/property/timezone> ?x FILTER ( ?uri != <http://dbpedia.org/resource/Utah> ) }</s>"
"<s>¿Qué país tiene más idiomas oficiales?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1</s>"
"<s>Welches Land gibt es die meisten Amtssprachen?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1</s>"
"<s>Какие страны имеют наибольшее число официальных языков?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> <http://dbpedia.org/ontology/Country> . ?uri <http://dbpedia.org/property/officialLanguages> ?language . } ORDER BY DESC(COUNT(?language)) OFFSET 0 LIMIT 1</s>"
"<s>¿Cuántos hombres y mujeres trabajan para los bomberos de Nueva York?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }</s>"
"<s>Wie viele Menschen arbeiten beim FDNY?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }</s>"
"<s>Какое общее число мужчин и женщин работает в пожарном департаменте Нью-Йорка?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }</s>"
"<s>Скільки чоловіків та жінок служили в FDNY?
SPARQL dbpedia:
SELECT DISTINCT ?num WHERE { <http://dbpedia.org/resource/New_York_City_Fire_Department> <http://dbpedia.org/property/employees> ?num }</s>"
"<s>¿Qué actor interpretó a Chewbacca?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>Wer spielte Chewbacca?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>Кто исполнил роль Чубакки?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>Як звали актора що грав роль Чубакки?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Chewbacca> <http://dbpedia.org/ontology/portrayer> ?uri }</s>"
"<s>¿Qué bibliotecas fueron fundadas antes de 1400?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/Library> ; <http://dbpedia.org/property/established> ?year FILTER ( ?year < 1400 ) }</s>"
"<s>¿Qué lenguajes de programación fueron influenciados por el Perl?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri } }</s>"
"<s>Welche Programmiersprachen wurden von Perl beeinflusst?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri } }</s>"
"<s>Какие языки программирования подчерпнули основы Perl?
SPARQL dbpedia:
SELECT DISTINCT ?uri WHERE { ?uri a <http://dbpedia.org/ontology/ProgrammingLanguage> { ?uri <http://dbpedia.org/ontology/influencedBy> <http://dbpedia.org/resource/Perl> } UNION { <http://dbpedia.org/resource/Perl> <http://dbpedia.org/ontology/influenced> ?uri } }</s>"
